/**
 *
 */
package com.iyuba.core.common.util;

import android.util.Log;

/**
 * 用于判断�?��数字是否是手机号
 *
 * @author Administrator
 *
 */
public class TelNumMatch {

	/*
	 * 移动: 2G号段(GSM网络)�?39,138,137,136,135,134,159,158,152,151,150,
	 * 3G号段(TD-SCDMA网络)�?57,182,183,188,187 147是移动TD上网卡专用号�? 联�?:
	 * 2G号段(GSM网络)�?30,131,132,155,156 3G号段(WCDMA网络)�?86,185 电信:
	 * 2G号段(CDMA网络)�?33,153 3G号段(CDMA网络)�?89,180
	 */

	//修改前
//	static String YD = "^[1]{1}(([3]{1}[4-9]{1})|([5]{1}[012789]{1})|([8]{1}[2378]{1})|([4]{1}[7]{1}))[0-9]{8}$";
//	static String LT = "^[1]{1}(([3]{1}[0-2]{1})|([5]{1}[56]{1})|([8]{1}[56]{1}))[0-9]{8}$";
//	static String DX = "^[1]{1}(([3]{1}[3]{1})|([5]{1}[3]{1})|([8]{1}[09]{1}))[0-9]{8}$";

	//修改后
	//YD:134 135 136 137 138 139 147 148 150 151 152 157 158 159  165 172 178 182 183 184 187 188 195 198
	//LT:130 131 132 145 146 155 156 166 171 175 176 185 186
	//DX:133 149 153 173 174 177 180 181 189  191  199

	//移动
	static String YD = "^[1]{1}(([3]{1}[4-9]{1})|([4]{1}[78]{1})|([5]{1}[012789]{1})|([6]{1}[5]{1})" +
			"|([7]{1}[28]{1})|([8]{1}[23478]{1})|([9]{1}[58]{1}))[0-9]{8}$";
	//联通
	static String LT = "^[1]{1}(([3]{1}[0-2]{1})|([4]{1}[56]{1})|([5]{1}[56]{1})|([6]{1}[6]{1})" +
			"|([7]{1}[156]{1})|([8]{1}[56]{1}))[0-9]{8}$";
	//电信
	static String DX = "^[1]{1}(([3]{1}[3]{1})|([4]{1}[9]{1})|([5]{1}[3]{1})|([7]{1}[347]{1})" +
			"|([8]{1}[019]{1})|([9]{1}[19]{1}))[0-9]{8}$";
	//虚拟
	static String XN = "^[1]{1}[7]{1}[0]{1}$";

	String mobPhnNum;

	public TelNumMatch(String mobPhnNum) {
		this.mobPhnNum = mobPhnNum;
		Log.d("tool", mobPhnNum);
	}

	public int matchNum() {
		/**
		 * flag = 1 YD 2 LT 3 DX 4 XN
		 */
		int flag;// 存储匹配结果
		// 判断手机号码是否�?1�?
		if (mobPhnNum.length() == 11) {
			// 判断手机号码是否符合中国移动的号码规�?
			if (mobPhnNum.matches(YD)) {
				flag = 1;
			}
			// 判断手机号码是否符合中国联�?的号码规�?
			else if (mobPhnNum.matches(LT)) {
				flag = 2;
			}
			// 判断手机号码是否符合中国电信的号码规�?
			else if (mobPhnNum.matches(DX)) {
				flag = 3;
			}
			// 判断手机号码是否符合虚拟号码规格
			else if (mobPhnNum.matches(XN)){
				flag = 4;
			}
			// 都不合�? 未知
			else {
				flag = 5;
			}
		}
		// 不是11�?
		else {
			flag = 6;
		}
		Log.d("TelNumMatch", "flag"+flag);
		//返回1,2,3,4 均认定为手机号，其他则认为不�?
		return flag;
	}
}